Repository: tyabu12/pastura
Catalog: Pastura/Pastura/Resources/Localizable.xcstrings
Source language: en
Languages: ja

source: relationship-update-placement: this 'relationship_update' cannot see its vote/choose signals — place it after the producing 'vote'/'choose' phase and before any 'prisoners_dilemma' 'score_calc', with no 'speak'/'choose' phase between the vote and it.
ja: relationship-update-placement: この 'relationship_update' は vote/choose のシグナルを参照できません — 生成元の 'vote'/'choose' フェーズの後、かつ 'prisoners_dilemma' の 'score_calc' より前に配置し、vote との間に 'speak'/'choose' フェーズを挟まないでください。

source: single-quoted-literal-in-condition: the operand %@ is single-quoted, but the condition evaluator treats only double quotes as string literals — it is read as an undefined identifier and the comparison is always false. Use double quotes instead.
ja: single-quoted-literal-in-condition: オペランド %@ はシングルクォートで囲まれていますが、条件評価器はダブルクォートのみを文字列リテラルとして扱います — 未定義の識別子として読み取られ、比較は常に false になります。代わりにダブルクォートを使用してください。

source: summarize-pairing-placeholders: this 'summarize' template references {agent1}-family placeholders, but no round-robin 'choose' phase runs earlier in the round, so the placeholders leak literally into the summary — add a round-robin 'choose' phase before this 'summarize', or remove the pairing placeholders.
ja: summarize-pairing-placeholders: この 'summarize' テンプレートは {agent1} 系のプレースホルダーを参照していますが、ラウンド内のより前にラウンドロビン形式の 'choose' フェーズが実行されないため、プレースホルダーがそのままサマリーにリークします — この 'summarize' より前にラウンドロビン形式の 'choose' フェーズを追加するか、ペアリング用プレースホルダーを削除してください。

source: this model
ja: このモデル

source: unknown-condition-identifier: '%@' is not a known condition variable (a derived variable, score, persona, extraData key, or engine-injected name), so it resolves to no value at runtime — check for a typo.
ja: unknown-condition-identifier: '%@' は既知の条件変数（派生変数、スコア、ペルソナ、extraData キー、エンジン注入名のいずれか）ではないため、実行時に値が解決されません — タイプミスがないか確認してください。

source: unresolvable-placeholder: the placeholder '{%@}' is supplied by no phase, so it leaks into the LLM prompt verbatim — check for a typo or remove it.
ja: unresolvable-placeholder: プレースホルダー '{%@}' はどのフェーズからも供給されないため、そのまま LLM プロンプトにリークします — タイプミスがないか確認するか削除してください。

source: vote-tally-needs-vote: 'vote_tally' scoring has no 'vote' phase earlier in the round, so it scores nothing or re-adds a stale tally — add a 'vote' phase before this 'score_calc'.
ja: vote-tally-needs-vote: 'vote_tally' スコアリングにはラウンド内のより前に 'vote' フェーズがないため、何も採点しないか古い集計を再加算します — この 'score_calc' より前に 'vote' フェーズを追加してください。

source: wordwolf-needs-assign-and-vote: 'wordwolf_judge' scoring needs both an 'assign' phase with target 'random_one' and a 'vote' phase earlier in the round, or it judges nothing — add the missing phase(s) before this 'score_calc'.
ja: wordwolf-needs-assign-and-vote: 'wordwolf_judge' スコアリングには、ラウンド内のより前にターゲット 'random_one' を持つ 'assign' フェーズと 'vote' フェーズの両方が必要です。ないと何も判定しません — 不足しているフェーズをこの 'score_calc' より前に追加してください。

source: ~%lld inferences
ja: ~%lld 回の推論

source: “%@” will be deleted. Past simulation results are kept and stay viewable.
ja: 「%@」を削除します。過去のシミュレーション結果は残り、引き続き閲覧できます。

source: ↳ sub-phase
ja: ↳ サブフェーズ
